# Pandas

[Pandas](https://pandas.pydata.org/) is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. It was developed mainly for working with relational or labeled data and provides two data structures, Series and DataFrame, for manipulating data.

Pandas Series is a one-dimensional labeled array that can store data of any type and has axis labels called indexes. Pandas DataFrame is a two-dimensional array (rows and columns) that is mutable and can store different data types.

The [10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html) guide provides a short introduction to pandas and was written mainly for new users.

Use `import` to load pandas using `pd` as an alias.

In [1]:
import pandas as pd
import numpy as np

Create a `Series` by passing a list of values.

In [2]:
s = pd.Series(
    [1, 3, 5, np.nan, 6, 8]
)
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Create a `DataFrame` by passing a `NumPy` array, with a datetime index and labelled columns.

In [3]:
dates = pd.date_range("20130101", periods = 6)

df = pd.DataFrame(
    np.random.randn(6, 4),
    index = dates,
    columns = list("ABCD")
)
df

                   A         B         C         D
2013-01-01 -0.053142  0.124200 -0.484236 -0.386821
2013-01-02 -0.451988 -0.593405  0.046765 -0.742244
2013-01-03 -0.222496 -0.416618 -1.246067  1.881277
2013-01-04 -0.671998  0.429872  0.522599 -0.640678
2013-01-05  0.607753 -0.164967 -1.313926  0.205464
2013-01-06 -1.391812 -0.797469 -1.155706  1.368963

Create three lists and a dictionary `d`.

In [4]:
col1 = list(range(1,6))
col2 = list(range(7, 12))
col3 = list(range(13, 18))

d = {
    'col1' : col1,
    'col2' : col2,
    'col3' : col3
}

print(type(d))

<class 'dict'>

Create a data frame `df`.

In [5]:
df = pd.DataFrame(d)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   col1  col2  col3
0     1     7    13
1     2     8    14
2     3     9    15
3     4    10    16
4     5    11    17

Name the rows. (Rows are called index and columns are called columns.)

In [6]:
df.index = ['one', 'two', 'three', 'four', 'five']
print(df)

       col1  col2  col3
one       1     7    13
two       2     8    14
three     3     9    15
four      4    10    16
five      5    11    17

Read from a CSV file and print first three rows.

In [7]:
iris = pd.read_csv("../data/iris.csv")
print(iris[0:3])

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

Use [loc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html) to access a group of rows and columns using labels or a boolean array. The example below uses the row names to access specific rows.

In [8]:
print(iris.loc[[1, 3, 5]])

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

All rows but specific columns.

In [9]:
iris.loc[:, ["Sepal.Length", "Petal.Length"]]

     Sepal.Length  Petal.Length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

Access specific rows and columns.

In [10]:
print(
    iris.loc[
        range(0,3),
        ['Sepal.Width', 'Sepal.Length']
    ]
)

   Sepal.Width  Sepal.Length
0          3.5           5.1
1          3.0           4.9
2          3.2           4.7

Use `iloc` to access rows and columns by integer position(s).

In [11]:
print(
    iris.iloc[
        [0, 1, 2],
        [1, 0]
    ]
)

   Sepal.Width  Sepal.Length
0          3.5           5.1
1          3.0           4.9
2          3.2           4.7

Note that there is a difference between a single square brackets (`Series`) and a double square brackets (`DataFrame`) when accessing columns. A `Series` is necessary for subsetting a `DataFrame`.

In [12]:
print(type(iris["Sepal.Length"]))
print(iris["Sepal.Length"])

<class 'pandas.core.series.Series'>
0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal.Length, Length: 150, dtype: float64

DataFrame.

In [13]:
print(type(iris[["Sepal.Length"]]))
print(iris[["Sepal.Length"]])

<class 'pandas.core.frame.DataFrame'>
     Sepal.Length
0             5.1
1             4.9
2             4.7
3             4.6
4             5.0
..            ...
145           6.7
146           6.3
147           6.5
148           6.2
149           5.9

[150 rows x 1 columns]

Subsetting using a Series.

In [14]:
long_sepal = iris["Sepal.Length"] > 7.5
print(type(long_sepal))
print(iris[long_sepal])

<class 'pandas.core.series.Series'>
     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
105           7.6          3.0           6.6          2.1  virginica
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
131           7.9          3.8           6.4          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica

Read a VCF file, which is really just a TSV file by using `read_csv` but using a tab separator.

In [15]:
vcf = pd.read_csv("../data/Pfeiffer.vcf.gz", sep="\t", comment="#", header=None)
vcf

,0,1,2,3,4,5,6,7,8,9
0,1,866511,rs60722469,C,CCCCT,258.62,PASS,AC=2;AF=1.00;AN=2;DB;DP=11;FS=0.000;HRun=0;Hap...,GT:AD:DP:GQ:PL,"1/1:6,5:11:14.79:300,15,0"
1,1,879317,rs7523549,C,T,150.77,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.455;DB;DP=21;...,GT:AD:DP:GQ:PL,"0/1:14,7:21:99:181,0,367"
2,1,879482,.,G,C,484.52,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.934;DP=48;Del...,GT:AD:DP:GQ:PL,"0/1:28,20:48:99:515,0,794"
3,1,880390,rs3748593,C,A,288.44,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=-4.517;DB;DP=29...,GT:AD:DP:GQ:PL,"0/1:14,15:29:99:318,0,399"
4,1,881627,rs2272757,G,A,486.24,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=0.199;DB;DP=33;...,GT:AD:DP:GQ:PL,"0/1:15,18:33:99:516,0,420"
...,...,...,...,...,...,...,...,...,...,...
37704,GL000225.1,90427,.,C,T,138.38,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=-0.382;DP=11;De...,GT:AD:DP:GQ:PL,"0/1:3,8:11:45.83:168,0,46"
37705,GL000192.1,101228,.,T,C,84.50,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.133;DP=10;Del...,GT:AD:DP:GQ:PL,"0/1:6,4:10:99:114,0,180"
37706,GL000192.1,101317,.,A,C,168.56,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.678;DP=18;Del...,GT:AD:DP:GQ:PL,"0/1:9,9:18:99:199,0,214"
37707,GL000192.1,139953,.,CTG,C,585.64,PASS,AC=2;AF=1.00;AN=2;DP=22;FS=0.000;HRun=0;Haplot...,GT:AD:DP:GQ:PL,"1/1:10,18:22:59.82:628,60,0"
37708,10,123256215,.,T,G,100.00,PASS,GENE=FGFR2;INHERITANCE=AD;MIM=101600,GT:DS:GL,"1|0:2.000:-5.00,-1.10,-0.04"

Rename columns.

In [16]:
vcf = vcf.set_axis(['CHROM','POS','VARIANT_ID','REF','ALT','QUAL','FILTER','INFO','FORMAT','SAMPLE'], axis='columns')
vcf

,CHROM,POS,VARIANT_ID,REF,ALT,QUAL,FILTER,INFO,FORMAT,SAMPLE
0,1,866511,rs60722469,C,CCCCT,258.62,PASS,AC=2;AF=1.00;AN=2;DB;DP=11;FS=0.000;HRun=0;Hap...,GT:AD:DP:GQ:PL,"1/1:6,5:11:14.79:300,15,0"
1,1,879317,rs7523549,C,T,150.77,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.455;DB;DP=21;...,GT:AD:DP:GQ:PL,"0/1:14,7:21:99:181,0,367"
2,1,879482,.,G,C,484.52,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.934;DP=48;Del...,GT:AD:DP:GQ:PL,"0/1:28,20:48:99:515,0,794"
3,1,880390,rs3748593,C,A,288.44,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=-4.517;DB;DP=29...,GT:AD:DP:GQ:PL,"0/1:14,15:29:99:318,0,399"
4,1,881627,rs2272757,G,A,486.24,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=0.199;DB;DP=33;...,GT:AD:DP:GQ:PL,"0/1:15,18:33:99:516,0,420"
...,...,...,...,...,...,...,...,...,...,...
37704,GL000225.1,90427,.,C,T,138.38,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=-0.382;DP=11;De...,GT:AD:DP:GQ:PL,"0/1:3,8:11:45.83:168,0,46"
37705,GL000192.1,101228,.,T,C,84.50,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.133;DP=10;Del...,GT:AD:DP:GQ:PL,"0/1:6,4:10:99:114,0,180"
37706,GL000192.1,101317,.,A,C,168.56,PASS,AC=1;AF=0.50;AN=2;BaseQRankSum=1.678;DP=18;Del...,GT:AD:DP:GQ:PL,"0/1:9,9:18:99:199,0,214"
37707,GL000192.1,139953,.,CTG,C,585.64,PASS,AC=2;AF=1.00;AN=2;DP=22;FS=0.000;HRun=0;Haplot...,GT:AD:DP:GQ:PL,"1/1:10,18:22:59.82:628,60,0"
37708,10,123256215,.,T,G,100.00,PASS,GENE=FGFR2;INHERITANCE=AD;MIM=101600,GT:DS:GL,"1|0:2.000:-5.00,-1.10,-0.04"

Write out using `to_csv` using `index=False` to remove row names.

In [17]:
vcf.to_csv('/tmp/out.tsv', sep="\t", index=False)

Since pandas is built on NumPy, we can also use NumPy booleans for subsetting.

In [18]:
import numpy as np

wanted = np.logical_and(
    iris["Sepal.Length"] > 7.5,
    iris["Petal.Length"] > 6.8
)

print(iris[wanted])

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
118           7.7          2.6           6.9          2.3  virginica

Using the `isin()` method for filtering.

In [19]:
iris[
    iris["Species"].isin(["setosa"])
].tail(3)

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

Use [apply](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html) to apply a function along an axis of a DataFrame. The example below applys the [str.upper](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.upper.html) function (convert strings to uppercase) to the `Species` Series and creates a new column called `SPECIES`.

In [20]:
iris["SPECIES"] = iris["Species"].apply(str.upper)
iris.loc[[0, 1, 2], ["Species", "SPECIES"]]

  Species SPECIES
0  setosa  SETOSA
1  setosa  SETOSA
2  setosa  SETOSA

Head of `DataFrame`.

In [21]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species SPECIES
0           5.1          3.5           1.4          0.2  setosa  SETOSA
1           4.9          3.0           1.4          0.2  setosa  SETOSA
2           4.7          3.2           1.3          0.2  setosa  SETOSA
3           4.6          3.1           1.5          0.2  setosa  SETOSA
4           5.0          3.6           1.4          0.2  setosa  SETOSA

Tail of `DataFrame`.

In [22]:
iris.tail(3)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,SPECIES
147,6.5,3.0,5.2,2.0,virginica,VIRGINICA
148,6.2,3.4,5.4,2.3,virginica,VIRGINICA
149,5.9,3.0,5.1,1.8,virginica,VIRGINICA

Display the index (row names):

In [23]:
iris.index

RangeIndex(start=0, stop=150, step=1)

Display columns:

In [24]:
iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species',
       'SPECIES'],
      dtype='object')

Quick summary statistics.

In [25]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Mean (automatically excluded non-numerical columns).

In [26]:
iris.mean()

/tmp/ipykernel_568/935066809.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  iris.mean()

Sepal.Length    5.843333
Sepal.Width     3.057333
Petal.Length    3.758000
Petal.Width     1.199333
dtype: float64

Transposing.

In [27]:
iris.T

,0,1,2,3,4,5,6,7,8,9,...,140,141,142,143,144,145,146,147,148,149
Sepal.Length,5.1,4.9,4.7,4.6,5.0,5.4,4.6,5.0,4.4,4.9,...,6.7,6.9,5.8,6.8,6.7,6.7,6.3,6.5,6.2,5.9
Sepal.Width,3.5,3.0,3.2,3.1,3.6,3.9,3.4,3.4,2.9,3.1,...,3.1,3.1,2.7,3.2,3.3,3.0,2.5,3.0,3.4,3.0
Petal.Length,1.4,1.4,1.3,1.5,1.4,1.7,1.4,1.5,1.4,1.5,...,5.6,5.1,5.1,5.9,5.7,5.2,5.0,5.2,5.4,5.1
Petal.Width,0.2,0.2,0.2,0.2,0.2,0.4,0.3,0.2,0.2,0.1,...,2.4,2.3,1.9,2.3,2.5,2.3,1.9,2.0,2.3,1.8
Species,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,...,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica
SPECIES,SETOSA,SETOSA,SETOSA,SETOSA,SETOSA,SETOSA,SETOSA,SETOSA,SETOSA,SETOSA,...,VIRGINICA,VIRGINICA,VIRGINICA,VIRGINICA,VIRGINICA,VIRGINICA,VIRGINICA,VIRGINICA,VIRGINICA,VIRGINICA

Sort by column.

In [28]:
iris.sort_values(by = "Petal.Length", ascending = False)

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,SPECIES
118,7.7,2.6,6.9,2.3,virginica,VIRGINICA
122,7.7,2.8,6.7,2.0,virginica,VIRGINICA
117,7.7,3.8,6.7,2.2,virginica,VIRGINICA
105,7.6,3.0,6.6,2.1,virginica,VIRGINICA
131,7.9,3.8,6.4,2.0,virginica,VIRGINICA
...,...,...,...,...,...,...
16,5.4,3.9,1.3,0.4,setosa,SETOSA
35,5.0,3.2,1.2,0.2,setosa,SETOSA
14,5.8,4.0,1.2,0.2,setosa,SETOSA
13,4.3,3.0,1.1,0.1,setosa,SETOSA
22,4.6,3.6,1.0,0.2,setosa,SETOSA

Joining.

In [29]:
left = pd.DataFrame(
    {"key": ["foo", "foo"],
     "lval": [1, 2]}
)

right = pd.DataFrame(
    {"key": ["foo", "foo"],
     "rval": [4, 5]}
)

pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Group by.

In [30]:
iris.groupby("Species").mean()

/tmp/ipykernel_568/3305375291.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  iris.groupby("Species").mean()

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026